import EstidamaCompany from '~/assets/img/estidama.png';
import JuthorCompany from '~/assets/img/juthor.png';
import WascoCompany from '~/assets/img/wasco.png';

interface ourCompanyDataTypes{
  img: string;
  caption: string;
}

export const data:Array<ourCompanyDataTypes> = [
  {
    img: EstidamaCompany,
    caption: "المركز الوطني لأبحاث وتطوير الزراعة المستدامة هو مركز أبحاث سعودي يعمل على تحقيق الزراعة المستدامة في المملكة العربية السعودية، وتم تأسيسه عام 2011 بدعم من سابك، ويديره مجلس إدارة برئاسة وزير البيئة والمياه والزراعة، ويتمحور عمل المركز حول زيادة إنتاج المحاصيل وتحسين جودتها وتقليل استخدام المبيدات وتحسين كفاءة استخدام المياه. ويقع المركز في جامعة الملك سعود بالرياض."
  },
  {
    img: WascoCompany,
    caption: "واسكو هي شركة رائدة في الإدارة المتكاملة للنفايات والتدوير في المملكة العربية السعودية، تأسست كشركة تابعة لـ Waste Collection & Recycling Co. Ltd في عام 2004. تسعى واسكو لتوفير خدمات متميزة لعملائها وتحقيق الاستدامة البيئية من خلال تقديم خدمات متكاملة لجمع وإعادة تدوير النفايات وإدارة النفايات المتكاملة."
  },
  {
    img: JuthorCompany, 
    caption: "شركة جذور هي الفرع الكامل المملوك لشركة ميبكو، والمخصصة لإنتاج لفائف الأنسجة عالية الجودة للعملاء في جميع أنحاء العالم. تتمتع الشركة بسعة تركيبية سنوية قدرها 60،000 طن وتمتلك مرافق تصنيع حديثة في مدينة الملك عبدالله الاقتصادية بالمملكة العربية السعودية. تلتزم جذور بتقديم الاستثنائية في كل جانب من جوانب أعمالها، سواء كنت تبحث عن حلول مستدامة أو أداء متفوق، فإن جذور لديها الخبرة والموارد اللازمة لتلبية احتياجاتك."
  }

]